"REGULAR EXPRESIONS"    #https://pythex.org/

"""
ЧИСЛА 0-9
    \d      връща цифрите
    \d      връща числата
        01q23wt4hh5ABCD


ВСИЧКО БЕЗ ЧИСЛА
    \D      връща поединични
    \D+     връща на низове
        012345ABCD
    
    
ОКАЗВА НАЧАЛОТО И/ИЛИ КРАЯ НА СЕЛЕКЦИЯТА
    \b      
        F[a-z]{3}\b
    \bF[a-z]{3}\b
        Ford Ford5 PFord


ВРЪЩА SPACES-а      може и само спейс
    \s
        А   Б   x
    
    
ВРЪЩА ВСИЧКО ОСВЕН СПЕЙСА
    \S


„ _ “, ЧИСЛА и БУКВИ
    \w
        PFord 555 22___ @@!#
    \W      всичко освен числа, „_“ и букви


„ + “ СПЕЦИАЛЕН СИМВОЛ - ТРЯБВА ДА СЕ ESCAPE-не
    \+
        +359


„ . “ МАЧВА СИМВОЛА СЛЕД НЕЯ
    +359.
    +359.+      мачва всички символи до края на реда
        TEL: +359123456 0888123456


„ * “ СИМВОЛЪТ КЪМ КОЙТО Е ПРИКРЕПЕНА МОЖЕ ДА ГО ИМА ИЛИ ДА ГО НЯМА
    asd\d
    asd\d*
        weerasd5addhh76
        weerasdaddhh76
        


„ | “ И/ИЛИ
    a|x
        abvgz wertx waxing


„ () “ ГРУПИРА
    (+359|0)\d+
        +359886123456    0886123456


МАЧВА ДО ОПРЕДЕДЛЕН БРОЙ СИМВОЛИ
    (\+359|0)\d{}
    +359123456888123456












"""

